testhound/alo/llir/octave/m480/M480Factory.cpp
#include <cassert>

using namespace std;

#include <LlirException.h>

#include "M480Factory.h"



namespace Llir
{

  M480Factory::M480Factory() : 
    OctaveFactory()
  {}

  M480Factory::~M480Factory()
  {}

  shared_ptr<OctaveInstruction>
  M480Factory::createAddwhInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1, 
				      shared_ptr<const Register> dst, 
				      shared_ptr<const LlirOperand> target)
  {
    return (shared_ptr<OctaveInstruction> (new M480AddwhInstruction(lineNum, 
								    srcLineNum,
								    srcFileName,
								    src1, 
								    dst, 
								    target)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createJaddwhInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const Register> src1, 
				       shared_ptr<const Register> dst, 
				       shared_ptr<const LlirOperand> target,
				       OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JaddwhInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     src1, 
								     dst, 
								     target,
								     probability)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createAddwlInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1, 
				      shared_ptr<const Register> dst, 
				      shared_ptr<const LlirOperand> target)
  {
    return (shared_ptr<OctaveInstruction> (new M480AddwlInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    dst, 
								    target)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createJaddwlInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const Register> src1, 
				       shared_ptr<const Register> dst, 
				       shared_ptr<const LlirOperand> target,
				       OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JaddwlInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     src1, 
								     dst, 
								     target,
								     probability)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createAddwwInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1, 
				      shared_ptr<const Register> dst, 
				      shared_ptr<const LlirOperand> target)
  {
    return (shared_ptr<OctaveInstruction> (new M480AddwwInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    dst, 
								    target)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createJaddwwInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const Register> src1, 
				       shared_ptr<const Register> dst, 
				       shared_ptr<const LlirOperand> target,
				       OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JaddwwInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     src1, 
								     dst, 
								     target,
								     probability)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createAddlInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> target)
  {
    return (shared_ptr<OctaveInstruction> (new M480AddlInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   dst, 
								   target)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createJaddlInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1, 
				      shared_ptr<const Register> dst, 
				      shared_ptr<const LlirOperand> target,
				      OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JaddlInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    dst, 
								    target,
								    probability)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createAddwhiInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const UnsignedImmediate> src1, 
				       shared_ptr<const Register> dst, 
				       shared_ptr<const LlirOperand> target)
  {
    return (shared_ptr<OctaveInstruction> (new M480AddwhiInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     src1, 
								     dst, 
								     target)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createJaddwhiInstruction(unsigned int lineNum,
					unsigned int srcLineNum,
					const char* srcFileName, 
					shared_ptr<const UnsignedImmediate> src1, 
					shared_ptr<const Register> dst, 
					shared_ptr<const LlirOperand> target,
					OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JaddwhiInstruction(lineNum, 
								      srcLineNum,
								      srcFileName, 
								      src1, 
								      dst, 
								      target,
								      probability)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createAddwliInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const UnsignedImmediate> src1, 
				       shared_ptr<const Register> dst, 
				       shared_ptr<const LlirOperand> target)
  {
    return (shared_ptr<OctaveInstruction> (new M480AddwliInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     src1, 
								     dst, 
								     target)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createJaddwliInstruction(unsigned int lineNum,
					unsigned int srcLineNum,
					const char* srcFileName, 
					shared_ptr<const UnsignedImmediate> src1, 
					shared_ptr<const Register> dst, 
					shared_ptr<const LlirOperand> target,
					OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JaddwliInstruction(lineNum, 
								      srcLineNum,
								      srcFileName, 
								      src1, 
								      dst, 
								      target,
								      probability)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createAddwwiInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const UnsignedImmediate> src1, 
				       shared_ptr<const Register> dst, 
				       shared_ptr<const LlirOperand> target)
  {
    return (shared_ptr<OctaveInstruction> (new M480AddwwiInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     src1, 
								     dst, 
								     target)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createJaddwwiInstruction(unsigned int lineNum,
					unsigned int srcLineNum,
					const char* srcFileName, 
					shared_ptr<const UnsignedImmediate> src1, 
					shared_ptr<const Register> dst, 
					shared_ptr<const LlirOperand> target,
					OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JaddwwiInstruction(lineNum, 
								      srcLineNum,
								      srcFileName, 
								      src1, 
								      dst, 
								      target,
								      probability)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createAddliInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const UnsignedImmediate> src1, 
				      shared_ptr<const Register> dst, 
				      shared_ptr<const LlirOperand> target)
  {
    return (shared_ptr<OctaveInstruction> (new M480AddliInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    dst, 
								    target)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createJaddliInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const UnsignedImmediate> src1, 
				       shared_ptr<const Register> dst, 
				       shared_ptr<const LlirOperand> target,
				       OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JaddliInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     src1, 
								     dst, 
								     target,
								     probability)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createSubwhInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1, 
				      shared_ptr<const Register> dst, 
				      shared_ptr<const LlirOperand> target)
  {
    return (shared_ptr<OctaveInstruction> (new M480SubwhInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    dst, 
								    target)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createJsubwhInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const Register> src1, 
				       shared_ptr<const Register> dst, 
				       shared_ptr<const LlirOperand> target,
				       OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JsubwhInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     src1, 
								     dst, 
								     target,
								     probability)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createSubwlInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1, 
				      shared_ptr<const Register> dst, 
				      shared_ptr<const LlirOperand> target)
  {
    return (shared_ptr<OctaveInstruction> (new M480SubwlInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    dst, 
								    target)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createJsubwlInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const Register> src1, 
				       shared_ptr<const Register> dst, 
				       shared_ptr<const LlirOperand> target,
				       OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JsubwlInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     src1, 
								     dst, 
								     target,
								     probability)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createSubwwInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1, 
				      shared_ptr<const Register> dst, 
				      shared_ptr<const LlirOperand> target)
  {
    return (shared_ptr<OctaveInstruction> (new M480SubwwInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    dst, 
								    target)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createJsubwwInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const Register> src1, 
				       shared_ptr<const Register> dst, 
				       shared_ptr<const LlirOperand> target,
				       OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JsubwwInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     src1, 
								     dst, 
								     target,
								     probability)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createSublInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> target)
  {
    return (shared_ptr<OctaveInstruction> (new M480SublInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   dst, 
								   target)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createJsublInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1, 
				      shared_ptr<const Register> dst, 
				      shared_ptr<const LlirOperand> target,
				      OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JsublInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    dst, 
								    target,
								    probability)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createSubwhiInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const UnsignedImmediate> src1, 
				       shared_ptr<const Register> dst, 
				       shared_ptr<const LlirOperand> target)
  {
    return (shared_ptr<OctaveInstruction> (new M480SubwhiInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     src1, 
								     dst, 
								     target)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createJsubwhiInstruction(unsigned int lineNum,
					unsigned int srcLineNum,
					const char* srcFileName, 
					shared_ptr<const UnsignedImmediate> src1, 
					shared_ptr<const Register> dst, 
					shared_ptr<const LlirOperand> target,
					OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JsubwhiInstruction(lineNum, 
								      srcLineNum,
								      srcFileName, 
								      src1, 
								      dst, 
								      target,
								      probability)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createSubwliInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const UnsignedImmediate> src1, 
				       shared_ptr<const Register> dst, 
				       shared_ptr<const LlirOperand> target)
  {
    return (shared_ptr<OctaveInstruction> (new M480SubwliInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     src1, 
								     dst, 
								     target)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createJsubwliInstruction(unsigned int lineNum,
					unsigned int srcLineNum,
					const char* srcFileName, 
					shared_ptr<const UnsignedImmediate> src1, 
					shared_ptr<const Register> dst, 
					shared_ptr<const LlirOperand> target,
					OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JsubwliInstruction(lineNum, 
								      srcLineNum,
								      srcFileName, 
								      src1, 
								      dst, 
								      target,
								      probability)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createSubwwiInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const UnsignedImmediate> src1, 
				       shared_ptr<const Register> dst, 
				       shared_ptr<const LlirOperand> target)
  {
    return (shared_ptr<OctaveInstruction> (new M480SubwwiInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     src1, 
								     dst, 
								     target)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createJsubwwiInstruction(unsigned int lineNum,
					unsigned int srcLineNum,
					const char* srcFileName, 
					shared_ptr<const UnsignedImmediate> src1, 
					shared_ptr<const Register> dst, 
					shared_ptr<const LlirOperand> target,
					OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JsubwwiInstruction(lineNum, 
								      srcLineNum,
								      srcFileName, 
								      src1, 
								      dst, 
								      target,
								      probability)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createSubliInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const UnsignedImmediate> src1, 
				      shared_ptr<const Register> dst, 
				      shared_ptr<const LlirOperand> target)
  {
    return (shared_ptr<OctaveInstruction> (new M480SubliInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    dst, 
								    target)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createJsubliInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const UnsignedImmediate> src1, 
				       shared_ptr<const Register> dst, 
				       shared_ptr<const LlirOperand> target,
				       OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JsubliInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     src1, 
								     dst, 
								     target,
								     probability)));
  }


  shared_ptr<OctaveInstruction> 
  M480Factory::createFfsInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> src1,
				    shared_ptr<const Register> dst, 
				    shared_ptr<const LlirOperand> abcFlag,
				    shared_ptr<const LlirOperand> findFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480FfsInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  src1, 
								  dst, 
								  abcFlag, 
								  findFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createFlsInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> src1,
				    shared_ptr<const Register> dst, 
				    shared_ptr<const LlirOperand> abcFlag,
				    shared_ptr<const LlirOperand> findFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480FlsInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  src1, 
								  dst, 
								  abcFlag, 
								  findFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createParInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> src1,
				    shared_ptr<const Register> dst, 
				    shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480ParInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  src1, 
								  dst, 
								  abcFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createAddInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> src1,
				    shared_ptr<const Register> src2, 
				    shared_ptr<const Register> dst, 
				    shared_ptr<const LlirOperand> abcFlag,
				    shared_ptr<const LlirOperand> modFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480AddInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  src1, 
								  src2, 
								  dst, 
								  abcFlag, 
								  modFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createAdd4xInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1,
				      shared_ptr<const Register> src2, 
				      shared_ptr<const Register> dst, 
				      shared_ptr<const LlirOperand> abcFlag,
				      shared_ptr<const LlirOperand> modFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480Add4xInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    src2, 
								    dst, 
								    abcFlag, 
								    modFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createAddcInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1,
				     shared_ptr<const Register> src2, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> abcFlag,
				     shared_ptr<const LlirOperand> modFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480AddcInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   dst, 
								   abcFlag, 
								   modFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createAddiInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1,
				     shared_ptr<const UnsignedImmediate> src2, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> abcFlag,
				     shared_ptr<const LlirOperand> modFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480AddiInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   dst, 
								   abcFlag, 
								   modFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createAddciInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1,
				      shared_ptr<const UnsignedImmediate> src2, 
				      shared_ptr<const Register> dst, 
				      shared_ptr<const LlirOperand> abcFlag,
				      shared_ptr<const LlirOperand> modFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480AddciInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    src2, 
								    dst, 
								    abcFlag, 
								    modFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createSubInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> src1,
				    shared_ptr<const Register> src2, 
				    shared_ptr<const Register> dst, 
				    shared_ptr<const LlirOperand> abcFlag,
				    shared_ptr<const LlirOperand> modFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480SubInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  src1, 
								  src2, 
								  dst, 
								  abcFlag, 
								  modFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createSubbInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1,
				     shared_ptr<const Register> src2, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> abcFlag,
				     shared_ptr<const LlirOperand> modFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480SubbInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   dst, 
								   abcFlag, 
								   modFlag)));
  }

