testhound/alo/llir/octave/m480/M480Factory.cpp
  shared_ptr<OctaveInstruction>
  M480Factory::createSubiInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1,
				     shared_ptr<const UnsignedImmediate> src2, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> abcFlag,
				     shared_ptr<const LlirOperand> modFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480SubiInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   dst, 
								   abcFlag, 
								   modFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createSubbiInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1,
				      shared_ptr<const UnsignedImmediate> src2, 
				      shared_ptr<const Register> dst, 
				      shared_ptr<const LlirOperand> abcFlag,
				      shared_ptr<const LlirOperand> modFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480SubbiInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    src2, 
								    dst, 
								    abcFlag, 
								    modFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createAndInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> src1,
				    shared_ptr<const Register> src2, 
				    shared_ptr<const Register> dst, 
				    shared_ptr<const LlirOperand> abcFlag,
				    shared_ptr<const LlirOperand> modFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480AndInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  src1, 
								  src2, 
								  dst, 
								  abcFlag, 
								  modFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createOrInstruction(unsigned int lineNum,
				   unsigned int srcLineNum,
				   const char* srcFileName, 
				   shared_ptr<const Register> src1,
				   shared_ptr<const Register> src2, 
				   shared_ptr<const Register> dst, 
				   shared_ptr<const LlirOperand> abcFlag,
				   shared_ptr<const LlirOperand> modFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480OrInstruction(lineNum, 
								 srcLineNum,
								 srcFileName, 
								 src1, 
								 src2, 
								 dst, 
								 abcFlag, 
								 modFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createXorInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> src1,
				    shared_ptr<const Register> src2, 
				    shared_ptr<const Register> dst, 
				    shared_ptr<const LlirOperand> abcFlag,
				    shared_ptr<const LlirOperand> modFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480XorInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  src1, 
								  src2, 
								  dst, 
								  abcFlag, 
								  modFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createMaxInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> src1,
				    shared_ptr<const Register> src2, 
				    shared_ptr<const Register> dst, 
				    shared_ptr<const LlirOperand> abcFlag,
				    shared_ptr<const LlirOperand> modFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480MaxInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  src1, 
								  src2, 
								  dst, 
								  abcFlag, 
								  modFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createMinInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> src1,
				    shared_ptr<const Register> src2, 
				    shared_ptr<const Register> dst, 
				    shared_ptr<const LlirOperand> abcFlag,
				    shared_ptr<const LlirOperand> modFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480MinInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  src1, 
								  src2, 
								  dst, 
								  abcFlag, 
								  modFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createRandInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1,
				     shared_ptr<const Register> src2, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480RandInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   dst, 
								   abcFlag)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createRotlInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1,
				     shared_ptr<const Register> src2, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480RotlInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   dst, 
								   abcFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createRotrInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1,
				     shared_ptr<const Register> src2, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480RotrInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   dst, 
								   abcFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createClrbInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1,
				     shared_ptr<const Register> src2, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480ClrbInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   dst, 
								   abcFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createSetbInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1,
				     shared_ptr<const Register> src2, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480SetbInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   dst, 
								   abcFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createShftInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1,
				     shared_ptr<const Register> src2, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480ShftInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   dst, 
								   abcFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createShftaInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1,
				      shared_ptr<const Register> src2, 
				      shared_ptr<const Register> dst, 
				      shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480ShftaInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    src2, 
								    dst, 
								    abcFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createShlInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> src1,
				    shared_ptr<const Register> src2, 
				    shared_ptr<const Register> dst, 
				    shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480ShlInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  src1, 
								  src2, 
								  dst, 
								  abcFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createShrInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> src1,
				    shared_ptr<const Register> src2, 
				    shared_ptr<const Register> dst, 
				    shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480ShrInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  src1, 
								  src2, 
								  dst, 
								  abcFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createShraInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1,
				     shared_ptr<const Register> src2, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480ShraInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   dst, 
								   abcFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createRandiInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1,
				      shared_ptr<const UnsignedImmediate> src2, 
				      shared_ptr<const Register> dst, 
				      shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480RandiInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    src2, 
								    dst, 
								    abcFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createRotliInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1,
				      shared_ptr<const UnsignedImmediate> src2, 
				      shared_ptr<const Register> dst, 
				      shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480RotliInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    src2, 
								    dst, 
								    abcFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createRotriInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1,
				      shared_ptr<const UnsignedImmediate> src2, 
				      shared_ptr<const Register> dst, 
				      shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480RotriInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    src2, 
								    dst, 
								    abcFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createSetbiInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1,
				      shared_ptr<const UnsignedImmediate> src2, 
				      shared_ptr<const Register> dst, 
				      shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480SetbiInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    src2, 
								    dst, 
								    abcFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createClrbiInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1,
				      shared_ptr<const UnsignedImmediate> src2, 
				      shared_ptr<const Register> dst, 
				      shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480ClrbiInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    src2, 
								    dst, 
								    abcFlag)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createShliInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1,
				     shared_ptr<const UnsignedImmediate> src2, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480ShliInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   dst, 
								   abcFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createShriInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1,
				     shared_ptr<const UnsignedImmediate> src2, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480ShriInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   dst, 
								   abcFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createShraiInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1,
				      shared_ptr<const UnsignedImmediate> src2, 
				      shared_ptr<const Register> dst, 
				      shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480ShraiInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    src2, 
								    dst, 
								    abcFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createMaxiInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1,
				     shared_ptr<const SignedImmediate> src2, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480MaxiInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   dst, 
								   abcFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createMiniInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1,
				     shared_ptr<const SignedImmediate> src2, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480MiniInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   dst, 
								   abcFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createAndiInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1,
				     shared_ptr<const SignedImmediate> src2, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480AndiInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   dst, 
								   abcFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createOriInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> src1,
				    shared_ptr<const SignedImmediate> src2, 
				    shared_ptr<const Register> dst, 
				    shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480OriInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  src1, 
								  src2, 
								  dst, 
								  abcFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createXoriInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1,
				     shared_ptr<const SignedImmediate> src2, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480XoriInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   dst, 
								   abcFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createMulInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> src1,
				    shared_ptr<const Register> src2, 
				    shared_ptr<const Register> dst, 
				    shared_ptr<const LlirOperand> sxFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480MulInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  src1, 
								  src2, 
								  dst, 
								  sxFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createMulhInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1,
				     shared_ptr<const Register> src2, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> sxFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480MulhInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   dst, 
								   sxFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createMuliInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1,
				     shared_ptr<const SignedImmediate> src2, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> sxFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480MuliInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   dst, 
								   sxFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createMulhiInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1,
				      shared_ptr<const SignedImmediate> src2, 
				      shared_ptr<const Register> dst, 
				      shared_ptr<const LlirOperand> sxFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480MulhiInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    src2, 
								    dst, 
								    sxFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createDivInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> src1,
				    shared_ptr<const Register> src2, 
				    shared_ptr<const Register> dst, 
				    shared_ptr<const LlirOperand> sxFlag)
  {
    // 480 has no Divide instructions

