testhound/alo/llir/octave/m480/M480Factory.cpp
    return (shared_ptr<OctaveInstruction> (new InvalidOctaveInstruction(lineNum, 
									srcLineNum,
									srcFileName)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createDiviInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1,
				     shared_ptr<const SignedImmediate> src2, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> sxFlag)
  {
    // 480 has no Divide instructions

    return (shared_ptr<OctaveInstruction> (new InvalidOctaveInstruction(lineNum, 
									srcLineNum,
									srcFileName)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createAddneInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1,
				      shared_ptr<const Register> src2, 
				      shared_ptr<const Register> dst)
  {
    return (shared_ptr<OctaveInstruction> (new M480AddneInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    src2, 
								    dst)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createAddneiInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const Register> src1,
				       shared_ptr<const UnsignedImmediate> src2, 
				       shared_ptr<const Register> dst)
  {
    return (shared_ptr<OctaveInstruction> (new M480AddneiInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     src1, 
								     src2, 
								     dst)));
  }

  shared_ptr<OctaveInstruction> 
  M480Factory::createByteswInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const Register> src1, 
				       shared_ptr<const Register> dst, 
				       shared_ptr<const UnsignedImmediate> b0, 
				       shared_ptr<const UnsignedImmediate> b1, 
				       shared_ptr<const UnsignedImmediate> b2, 
				       shared_ptr<const UnsignedImmediate> b3,
				       shared_ptr<const LlirOperand> abcFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480ByteswInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     src1,
								     dst, 
								     b0, 
								     b1, 
								     b2,
								     b3, 
								     abcFlag)));
  }
	
  shared_ptr<OctaveInstruction> 
  M480Factory::createBcdrInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1, 
				     shared_ptr<EssFlag> essFlag, 
				     shared_ptr<const LlirOperand> dst, 
				     shared_ptr<const LlirOperand> flags)
  {
    return (shared_ptr<OctaveInstruction> (new M480BcdrInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1,
								   essFlag, 
								   dst, 
								   flags)));
  }
	
  shared_ptr<OctaveInstruction> 
  M480Factory::createJbcdrInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1, 
				      shared_ptr<EssFlag> essFlag, 
				      shared_ptr<const LlirOperand> dst, 
				      shared_ptr<const LlirOperand> flags,
				      shared_ptr<const LlirOperand> targetList,
				      OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JbcdrInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1,
								    essFlag, 
								    dst, 
								    flags, 
								    targetList,
								    probability)));
  }

  shared_ptr<OctaveInstruction> 
  M480Factory::createBcrInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> src1, 
				    shared_ptr<EssFlag> essFlag, 
				    shared_ptr<const LlirOperand> dst, 
				    shared_ptr<const LlirOperand> flags)
  {
    return (shared_ptr<OctaveInstruction> (new M480BcrInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  src1,
								  essFlag, 
								  dst, 
								  flags)));
  }

  shared_ptr<OctaveInstruction> 
  M480Factory::createJbcrInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1, 
				     shared_ptr<EssFlag> essFlag, 
				     shared_ptr<const LlirOperand> dst, 
				     shared_ptr<const LlirOperand> flags,
				     shared_ptr<const LlirOperand> targetList,
				     OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JbcrInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1,
								   essFlag, 
								   dst, 
								   flags, 
								   targetList,
								   probability)));
  }

  shared_ptr<OctaveInstruction> 
  M480Factory::createBcdiInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const LlirOperand> src1, 
				     shared_ptr<EssFlag> essFlag, 
				     shared_ptr<const LlirOperand> dst, 
				     shared_ptr<const LlirOperand> flags)
  {
    return (shared_ptr<OctaveInstruction> (new M480BcdiInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1,
								   essFlag, 
								   dst, 
								   flags)));
  }

  shared_ptr<OctaveInstruction> 
  M480Factory::createJbcdiInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const LlirOperand> src1, 
				      shared_ptr<EssFlag> essFlag, 
				      shared_ptr<const LlirOperand> dst, 
				      shared_ptr<const LlirOperand> flags,
				      OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JbcdiInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1,
								    essFlag, 
								    dst, 
								    flags,
								    probability)));
  }

  shared_ptr<OctaveInstruction> 
  M480Factory::createBciInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const LlirOperand> src1, 
				    shared_ptr<EssFlag> essFlag, 
				    shared_ptr<const LlirOperand> dst, 
				    shared_ptr<const LlirOperand> flags)
  {
    return (shared_ptr<OctaveInstruction> (new M480BciInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  src1,
								  essFlag, 
								  dst, 
								  flags)));
  }

  shared_ptr<OctaveInstruction> 
  M480Factory::createJbciInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const LlirOperand> src1, 
				     shared_ptr<EssFlag> essFlag, 
				     shared_ptr<const LlirOperand> dst, 
				     shared_ptr<const LlirOperand> flags,
				     OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JbciInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1,
								   essFlag, 
								   dst, 
								   flags,
								   probability)));
  }

  shared_ptr<OctaveInstruction> 
  M480Factory::createBnzrInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1, 
				     shared_ptr<const Register> src2,
				     shared_ptr<const LlirOperand> cmpReg)
  {
    return (shared_ptr<OctaveInstruction> (new M480BnzrInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   cmpReg)));
  }


  shared_ptr<OctaveInstruction> 
  M480Factory::createJbnzrInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1, 
				      shared_ptr<const Register> src2,
				      shared_ptr<const LlirOperand> cmpReg,
				      shared_ptr<const LlirOperand> targetList,
				      OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JbnzrInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    src2, 
								    cmpReg, 
								    targetList,
								    probability)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createBzrInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> src1, 
				    shared_ptr<const Register> src2, 
				    shared_ptr<const LlirOperand> cmpReg)
  {
    return (shared_ptr<OctaveInstruction> (new M480BzrInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  src1, 
								  src2, 
								  cmpReg)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createJbzrInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1, 
				     shared_ptr<const Register> src2, 
				     shared_ptr<const LlirOperand> cmpReg,
				     shared_ptr<const LlirOperand> targetList,
				     OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JbzrInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   cmpReg, 
								   targetList,
								   probability)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createBnziInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1, 
				     shared_ptr<const LlirOperand> src2, 
				     shared_ptr<const LlirOperand> cmpReg)
  {
    return (shared_ptr<OctaveInstruction> (new M480BnziInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   cmpReg)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createJbnziInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1, 
				      shared_ptr<const LlirOperand> src2, 
				      shared_ptr<const LlirOperand> cmpReg,
				      OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JbnziInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    src2, 
								    cmpReg,
								    probability)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createBziInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> src1, 
				    shared_ptr<const LlirOperand> src2, 
				    shared_ptr<const LlirOperand> cmpReg)
  {
    return (shared_ptr<OctaveInstruction> (new M480BziInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  src1, 
								  src2, 
								  cmpReg)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createJbziInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1, 
				     shared_ptr<const LlirOperand> src2, 
				     shared_ptr<const LlirOperand> cmpReg,
				     OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JbziInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   cmpReg,
								   probability)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createTsetbInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1, 
				      shared_ptr<const UnsignedImmediate> bitpos, 
				      shared_ptr<const LlirOperand> disp)
  {
    return (shared_ptr<OctaveInstruction> (new M480TsetbInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    bitpos, 
								    disp)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createJtsetbInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const Register> src1, 
				       shared_ptr<const UnsignedImmediate> bitpos, 
				       shared_ptr<const LlirOperand> disp,
				       OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JtsetbInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     src1, 
								     bitpos, 
								     disp,
								     probability)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createTclrbInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1, 
				      shared_ptr<const UnsignedImmediate> bitpos, 
				      shared_ptr<const LlirOperand> disp)
  {
    return (shared_ptr<OctaveInstruction> (new M480TclrbInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    bitpos, 
								    disp)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createJtclrbInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const Register> src1, 
				       shared_ptr<const UnsignedImmediate> bitpos, 
				       shared_ptr<const LlirOperand> disp,
				       OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JtclrbInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     src1, 
								     bitpos, 
								     disp,
								     probability)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createRnmiInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const LlirOperand> diFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480RnmiInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   diFlag)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createJrnmiInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const LlirOperand> diFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480JrnmiInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    diFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createRintInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const LlirOperand> diFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480RintInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   diFlag)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createJrintInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const LlirOperand> diFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480JrintInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    diFlag)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createBrsInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const LlirOperand> dst)
  {
    return (shared_ptr<OctaveInstruction> (new M480BrsInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  dst)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createJbrsInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const LlirOperand> dst)
  {
    return (shared_ptr<OctaveInstruction> (new M480JbrsInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   dst)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createBrslInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const LlirOperand> brslFlags)
  {
    return (shared_ptr<OctaveInstruction> (new M480BrslInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   brslFlags)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createJbrslInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const LlirOperand> brslFlags)
  {
    return (shared_ptr<OctaveInstruction> (new M480JbrslInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    brslFlags)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createBrspreInstruction(unsigned int lineNum, 
				       unsigned int srcLineNum,
				       const char* srcFileName)
  {
    return (shared_ptr<OctaveInstruction> (new M480BrspreInstruction(lineNum, 
								     srcLineNum,
								     srcFileName)));
  }
				       
  shared_ptr<OctaveInstruction>
  M480Factory::createCmpInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> src1, 
				    shared_ptr<const Register> src2,
				    shared_ptr<const LlirOperand> abcFlag, 
				    shared_ptr<const LlirOperand> branchTarget)
  {
    return (shared_ptr<OctaveInstruction> (new M480CmpInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  src1, 
								  src2,
								  abcFlag, 
								  branchTarget)));
  }

  shared_ptr<OctaveInstruction> 
  M480Factory::createCmpiInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1, 
				     shared_ptr<const SignedImmediate> src2, 
				     shared_ptr<const LlirOperand> abcFlag, 
				     shared_ptr<const LlirOperand> branchTarget)
  {
    return (shared_ptr<OctaveInstruction> (new M480CmpiInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2,
								   abcFlag, 
								   branchTarget)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createJcmpInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1, 
				     shared_ptr<const Register> src2,
				     shared_ptr<const LlirOperand> abcFlag, 
				     shared_ptr<const LlirOperand> branchTarget,
				     OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JcmpInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2,
								   abcFlag, 
								   branchTarget,
								   probability)));
  }

  shared_ptr<OctaveInstruction> 
  M480Factory::createJcmpiInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1, 
				      shared_ptr<const SignedImmediate> src2, 
				      shared_ptr<const LlirOperand> abcFlag, 
				      shared_ptr<const LlirOperand> branchTarget,
				      OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JcmpiInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    src2,
								    abcFlag, 
								    branchTarget,
								    probability)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createCmprInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1,
				     shared_ptr<const Register> src2, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> abcFlag,
				     shared_ptr<const LlirOperand> signFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480CmprInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1, 
								   src2, 
								   dst, 
								   abcFlag, 
								   signFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createCmpriInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1,
				      shared_ptr<const SignedImmediate> src2, 
				      shared_ptr<const Register> dst, 
				      shared_ptr<const LlirOperand> abcFlag,
				      shared_ptr<const LlirOperand> signFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480CmpriInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1, 
								    src2, 
								    dst, 
								    abcFlag, 
								    signFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createBiInstruction(unsigned int lineNum,
				   unsigned int srcLineNum,
				   const char* srcFileName, 
				   shared_ptr<const LlirOperand> src1,
				   shared_ptr<const LlirOperand> dst, 
				   shared_ptr<const LlirOperand> cdFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480BiInstruction(lineNum, 
								 srcLineNum,
								 srcFileName, 
								 src1, 
								 dst, 
								 cdFlag)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createJbiInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const LlirOperand> src1,
				    shared_ptr<const LlirOperand> dst, 
				    shared_ptr<const LlirOperand> cdFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480JbiInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  src1, 
								  dst, 
								  cdFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createBrInstruction(unsigned int lineNum,
				   unsigned int srcLineNum,
				   const char* srcFileName, 
				   shared_ptr<const Register> src1,
				   shared_ptr<const LlirOperand> dst)
  {
    return (shared_ptr<OctaveInstruction> (new M480BrInstruction(lineNum, 
								 srcLineNum,
								 srcFileName, 
								 src1, 
								 dst)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createJtablebrInstruction(unsigned int lineNum,
					 unsigned int srcLineNum,
					 const char* srcFileName, 
					 shared_ptr<const Register> src1,
					 shared_ptr<const LlirOperand> dst)
  {
    return (shared_ptr<OctaveInstruction> (new M480JtablebrInstruction(lineNum, 
								       srcLineNum,
								       srcFileName, 
								       src1, 
								       dst)));
  }
  
  shared_ptr<OctaveInstruction>
  M480Factory::createJtableRelativebrInstruction(unsigned int lineNum,
						 unsigned int srcLineNum,
						 const char* srcFileName, 
						 shared_ptr<const Register> src1,
						 shared_ptr<const LlirOperand> dst)
  {
    return (shared_ptr<OctaveInstruction> (new M480JtableRelativebrInstruction(lineNum, 
									       srcLineNum,
									       srcFileName, 
									       src1, 
									       dst)));
  }
  
  shared_ptr<OctaveInstruction>
  M480Factory::createJbrInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> src1,
				    shared_ptr<const LlirOperand> dst,
				    shared_ptr<const LlirOperand> targetList)
  {
    return (shared_ptr<OctaveInstruction> (new M480JbrInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  src1, 
								  dst, 
								  targetList)));
  }

