testhound/alo/llir/octave/m480/M480Factory.cpp
  shared_ptr<OctaveInstruction>
  M480Factory::createDepbInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src, 
				     shared_ptr<const UnsignedImmediate> srcBitNum,
				     shared_ptr<const Register> dst,
				     shared_ptr<const UnsignedImmediate> dstBitNum, 
				     shared_ptr<const UnsignedImmediate> numBits, 
				     shared_ptr<const LlirOperand> depbFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480DepbInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src,
								   srcBitNum, 
								   dst,
								   dstBitNum,
								   numBits, 
								   depbFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createExtbInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src, 
				     shared_ptr<const UnsignedImmediate> srcBitNum,
				     shared_ptr<const Register> dst,
				     shared_ptr<const UnsignedImmediate> dstBitNum, 
				     shared_ptr<const UnsignedImmediate> numBits, 
				     shared_ptr<const LlirOperand> signFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480ExtbInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src,
								   srcBitNum, 
								   dst,
								   dstBitNum,
								   numBits, 
								   signFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createDepbiInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const UnsignedImmediate> src, 
				      shared_ptr<const Register> dst,
				      shared_ptr<const UnsignedImmediate> dstBitNum, 
				      shared_ptr<const UnsignedImmediate> numBits, 
				      shared_ptr<const LlirOperand> depbFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480DepbiInstruction(lineNum, 
								    srcLineNum,
								    srcFileName,
								    src,
								    dst,
								    dstBitNum,
								    numBits, 
								    depbFlag)));
  }


  shared_ptr<OctaveInstruction> 
  M480Factory::createCmovInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1,
				     shared_ptr<const Register> src2, 
				     shared_ptr<const Register> dst, 
				     shared_ptr<EssFlag> essFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480CmovInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src1,
								   src2, 
								   dst,
								   essFlag)));
  }

  shared_ptr<OctaveInstruction> 
  M480Factory::createCmoviInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1,
				      shared_ptr<const UnsignedImmediate> src2, 
				      shared_ptr<const Register> dst, 
				      shared_ptr<EssFlag> essFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480CmoviInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src1,
								    src2, 
								    dst,
								    essFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createDmapInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src1,
				     shared_ptr<const UnsignedImmediate> flags)
  {
    return (shared_ptr<OctaveInstruction> (new M480DmapInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   convertSingleToDmaMultiReg(src1), 
								   flags)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createDmasrInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1,
				      shared_ptr<const UnsignedImmediate> flags)
  {
    return (shared_ptr<OctaveInstruction> (new M480DmasrInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    convertSingleToDmaMultiReg(src1), 
								    flags)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createDmau0Instruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1,
				      shared_ptr<const UnsignedImmediate> flags)
  {
    return (shared_ptr<OctaveInstruction> (new M480Dmau0Instruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    convertSingleToDmaMultiReg(src1), 
								    flags)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createDmau1Instruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> src1,
				      shared_ptr<const UnsignedImmediate> flags)
  {
    return (shared_ptr<OctaveInstruction> (new M480Dmau1Instruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    convertSingleToDmaMultiReg(src1),
								    flags)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createLihInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> dst,
				    shared_ptr<const LlirOperand> src)
  {
    return (shared_ptr<OctaveInstruction> (new M480LihInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  dst, 
								  src)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createLilInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> dst,
				    shared_ptr<const LlirOperand> src)
  {
    return (shared_ptr<OctaveInstruction> (new M480LilInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  dst, 
								  src)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createLwihInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> dst,
				     shared_ptr<const LlirOperand> src)
  {
    return (shared_ptr<OctaveInstruction> (new M480LwihInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   dst, 
								   src)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createLwilInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> dst,
				     shared_ptr<const LlirOperand> src)
  {
    return (shared_ptr<OctaveInstruction> (new M480LwilInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   dst, 
								   src)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createLaihInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> dst,
				     shared_ptr<const LlirOperand> src)
  {
    return (shared_ptr<OctaveInstruction> (new M480LaihInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   dst, 
								   src)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createLailInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> dst,
				     shared_ptr<const LlirOperand> src)
  {
    return (shared_ptr<OctaveInstruction> (new M480LailInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   dst, 
								   src)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createNopInstruction(unsigned int lineNum, 
				    unsigned int srcLineNum,
				    const char* srcFileName)
  {
    return (shared_ptr<OctaveInstruction> (new M480NopInstruction(lineNum, 
								  srcLineNum,
								  srcFileName)));
  }
  
  shared_ptr<OctaveInstruction> 
  M480Factory::createHec5Instruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src,
				     shared_ptr<const Register> dst,
				     shared_ptr<const UnsignedImmediate> bytes,
				     shared_ptr<const LlirOperand> cumeFlag, 
				     shared_ptr<const LlirOperand> branchTarget)
  {
    return (shared_ptr<OctaveInstruction> (new M480Hec5Instruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src, 
								   dst,
								   bytes, 
								   branchTarget,
								   cumeFlag)));
  }

  shared_ptr<OctaveInstruction> 
  M480Factory::createJHec5Instruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src,
				     shared_ptr<const Register> dst,
				     shared_ptr<const UnsignedImmediate> bytes,
				     shared_ptr<const LlirOperand> cumeFlag, 
				     shared_ptr<const LlirOperand> branchTarget,
				     OctaveInstruction::BranchProbability probability)
  {
    return (shared_ptr<OctaveInstruction> (new M480JHec5Instruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    src, 
								    dst,
								    bytes, 
								    branchTarget,
								    cumeFlag,
								    probability)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createMvInstruction(unsigned int lineNum,
				   unsigned int srcLineNum,
				   const char* srcFileName, 
				   shared_ptr<const Register> src,
				   shared_ptr<const Register> dst)
  {
    return (shared_ptr<OctaveInstruction> (new M480MvInstruction(lineNum, 
								 srcLineNum,
								 srcFileName, 
								 src, 
								 dst)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createMvhrInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src,
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> mvhFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480MvhrInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src, 
								   dst, 
								   mvhFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createMvrhInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> src,
				     shared_ptr<const Register> dst, 
				     shared_ptr<const LlirOperand> mvhFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480MvrhInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   src, 
								   dst, 
								   mvhFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createUnlinkInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const Register> regs)
  {
    return (shared_ptr<OctaveInstruction> (new M480UnlinkInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     convertSingleToMultiReg(regs))));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createLinkInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> regs,
				     shared_ptr<OctaveMemory> mem, 
				     shared_ptr<const LinkFlag> linkFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480LinkInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   convertSingleToMultiReg(regs),
								   mem, 
								   linkFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createLinksInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> regs,
				      shared_ptr<OctaveMemory> mem, 
				      shared_ptr<const LinkFlag> linkFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480LinksInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    convertSingleToMultiReg(regs),
								    mem, 
								    linkFlag)));
  }
  
  shared_ptr<OctaveInstruction>
  M480Factory::createLinkspInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const Register> regs,
				       shared_ptr<OctaveMemory> mem, 
				       shared_ptr<const LinkFlag> linkFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480LinkspInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     convertSingleToMultiReg(regs),
								     mem, 
								     linkFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createLinksplInstruction(unsigned int lineNum,
					unsigned int srcLineNum,
					const char* srcFileName, 
					shared_ptr<const Register> regs,
					shared_ptr<OctaveMemory> mem, 
					shared_ptr<const LinkFlag> linkFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480LinksplInstruction(lineNum, 
								      srcLineNum,
								      srcFileName, 
								      convertSingleToMultiReg(regs),
								      mem, 
								      linkFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createLinksrInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const Register> regs,
				       shared_ptr<OctaveMemory> mem, 
				       shared_ptr<const LinkFlag> linkFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480LinksrInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     convertSingleToMultiReg(regs),
								     mem, 
								     linkFlag)));
  }
  
  shared_ptr<OctaveInstruction>
  M480Factory::createLinksdInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const Register> regs,
				       shared_ptr<OctaveMemory> mem, 
				       shared_ptr<const LinkFlag> linkFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480LinksdInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     convertSingleToMultiReg(regs),
								     mem, 
								     linkFlag)));
  }
  
  shared_ptr<OctaveInstruction>
  M480Factory::createLinkccInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const Register> regs,
				       shared_ptr<OctaveMemory> mem, 
				       shared_ptr<const LinkFlag> linkFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480LinkccInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     convertSingleToMultiReg(regs),
								     mem, 
								     linkFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createLinkcclInstruction(unsigned int lineNum,
					unsigned int srcLineNum,
					const char* srcFileName, 
					shared_ptr<const Register> regs,
					shared_ptr<OctaveMemory> mem, 
					shared_ptr<const LinkFlag> linkFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480LinkcclInstruction(lineNum, 
								      srcLineNum,
								      srcFileName, 
								      convertSingleToMultiReg(regs),
								      mem, 
								      linkFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createLinksioInstruction(unsigned int lineNum,
					unsigned int srcLineNum,
					const char* srcFileName, 
					shared_ptr<const Register> regs,
					shared_ptr<OctaveMemory> mem, 
					shared_ptr<const LinkFlag> linkFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480LinksioInstruction(lineNum, 
								      srcLineNum,
								      srcFileName, 
								      convertSingleToMultiReg(regs),
								      mem, 
								      linkFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createLmmInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> regs,
				    shared_ptr<OctaveMemory> mem, 
				    shared_ptr<const LlirOperand> linkFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480LmmInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  convertSingleToMultiReg(regs),
								  mem, 
								  linkFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createLmmspInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> regs,
				      shared_ptr<OctaveMemory> mem, 
				      shared_ptr<const LlirOperand> linkFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480LmmspInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    convertSingleToMultiReg(regs),
								    mem, 
								    linkFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createLmmsplInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const Register> regs,
				       shared_ptr<OctaveMemory> mem, 
				       shared_ptr<const LlirOperand> linkFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480LmmsplInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     convertSingleToMultiReg(regs),
								     mem, 
								     linkFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createLmmsrInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> regs,
				      shared_ptr<OctaveMemory> mem, 
				      shared_ptr<const LlirOperand> linkFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480LmmsrInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    convertSingleToMultiReg(regs),
								    mem, 
								    linkFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createLmmsdInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> regs,
				      shared_ptr<OctaveMemory> mem, 
				      shared_ptr<const LlirOperand> linkFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480LmmsdInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    convertSingleToMultiReg(regs),
								    mem, 
								    linkFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createLmmccInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> regs,
				      shared_ptr<OctaveMemory> mem, 
				      shared_ptr<const LlirOperand> linkFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480LmmccInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    convertSingleToMultiReg(regs),
								    mem, 
								    linkFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createLmmcclInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const Register> regs,
				       shared_ptr<OctaveMemory> mem, 
				       shared_ptr<const LlirOperand> linkFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480LmmcclInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     convertSingleToMultiReg(regs),
								     mem, 
								     linkFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createLmmsiInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> regs,
				      shared_ptr<OctaveMemory> mem, 
				      shared_ptr<const LlirOperand> linkFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480LmmsiInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    convertSingleToMultiReg(regs),
								    mem, 
								    linkFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createLmmsInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> regs,
				     shared_ptr<OctaveMemory> mem, 
				     shared_ptr<const LlirOperand> linkFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480LmmsInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   convertSingleToMultiReg(regs),
								   mem, 
								   linkFlag)));
  }


  shared_ptr<OctaveInstruction>
  M480Factory::createLspInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> regs,
				    shared_ptr<OctaveMemory> mem, 
				    shared_ptr<const LlirOperand> linkFlag)
  {
    return (shared_ptr<OctaveInstruction> (new M480LspInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  convertSingleToMultiReg(regs),
								  mem, 
								  linkFlag)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createSmmInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> regs,
				    shared_ptr<OctaveMemory> mem)
  {
    return (shared_ptr<OctaveInstruction> (new M480SmmInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  convertSingleToMultiReg(regs),
								  mem)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createSmmspInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> regs,
				      shared_ptr<OctaveMemory> mem)
  {
    return (shared_ptr<OctaveInstruction> (new M480SmmspInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    convertSingleToMultiReg(regs),
								    mem)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createSmmsplInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const Register> regs,
				       shared_ptr<OctaveMemory> mem)
  {
    return (shared_ptr<OctaveInstruction> (new M480SmmsplInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     convertSingleToMultiReg(regs),
								     mem)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createSmmsrInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> regs,
				      shared_ptr<OctaveMemory> mem)
  {
    return (shared_ptr<OctaveInstruction> (new M480SmmsrInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    convertSingleToMultiReg(regs),
								    mem)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createSmmsdInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> regs,
				      shared_ptr<OctaveMemory> mem)
  {
    return (shared_ptr<OctaveInstruction> (new M480SmmsdInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    convertSingleToMultiReg(regs),
								    mem)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createSmmccInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> regs,
				      shared_ptr<OctaveMemory> mem)
  {
    return (shared_ptr<OctaveInstruction> (new M480SmmccInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    convertSingleToMultiReg(regs),
								    mem)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createSmmcclInstruction(unsigned int lineNum,
				       unsigned int srcLineNum,
				       const char* srcFileName, 
				       shared_ptr<const Register> regs,
				       shared_ptr<OctaveMemory> mem)
  {
    return (shared_ptr<OctaveInstruction> (new M480SmmcclInstruction(lineNum, 
								     srcLineNum,
								     srcFileName, 
								     convertSingleToMultiReg(regs),
								     mem)));
  }

