testhound/alo/llir/octave/m480/M480Factory.cpp
  shared_ptr<OctaveInstruction>
  M480Factory::createSmmsiInstruction(unsigned int lineNum,
				      unsigned int srcLineNum,
				      const char* srcFileName, 
				      shared_ptr<const Register> regs,
				      shared_ptr<OctaveMemory> mem)
  {
    return (shared_ptr<OctaveInstruction> (new M480SmmsiInstruction(lineNum, 
								    srcLineNum,
								    srcFileName, 
								    convertSingleToMultiReg(regs),
								    mem)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createSmmsInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> regs,
				     shared_ptr<OctaveMemory> mem)
  {
    return (shared_ptr<OctaveInstruction> (new M480SmmsInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   convertSingleToMultiReg(regs),
								   mem)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createSspInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> regs,
				    shared_ptr<OctaveMemory> mem)
  {
    return (shared_ptr<OctaveInstruction> (new M480SspInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  convertSingleToMultiReg(regs),
								  mem)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createPutInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> rsa,
				    shared_ptr<const Register> rsb, 
				    shared_ptr<const LlirOperand> flags)
  {
    return (shared_ptr<OctaveInstruction> (new InvalidOctaveInstruction(lineNum, 
									srcLineNum,
									srcFileName)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createGetInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> rsa,
				    shared_ptr<const LlirOperand> flags)
  {
    return (shared_ptr<OctaveInstruction> (new M480GetInstruction(lineNum, 
								  srcLineNum,
								  srcFileName, 
								  rsa, 
								  flags)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createPolInstruction(unsigned int lineNum,
				    unsigned int srcLineNum,
				    const char* srcFileName, 
				    shared_ptr<const Register> rsa,
				    shared_ptr<const LlirOperand> flags)
  {
    return (shared_ptr<OctaveInstruction> (new InvalidOctaveInstruction(lineNum, 
									srcLineNum,
									srcFileName)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createPutcInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> rsa,
				     shared_ptr<const Register> rsb, 
				     shared_ptr<const LlirOperand> flags)
  {
    return (shared_ptr<OctaveInstruction> (new M480PutcInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   rsa, 
								   rsb, 
								   flags)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createPutmInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> rsa,
				     shared_ptr<const Register> rsb, 
				     shared_ptr<const LlirOperand> flags)
  {
    return (shared_ptr<OctaveInstruction> (new M480PutmInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   rsa, 
								   rsb, 
								   flags)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createPutpInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> rsa,
				     shared_ptr<const Register> rsb, 
				     shared_ptr<const LlirOperand> flags)
  {
    return (shared_ptr<OctaveInstruction> (new M480PutpInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   rsa, 
								   rsb, 
								   flags)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createPutdInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const Register> rsa,
				     shared_ptr<const Register> rsb, 
				     shared_ptr<const LlirOperand> flags)
  {
    return (shared_ptr<OctaveInstruction> (new M480PutdInstruction(lineNum, 
								   srcLineNum,
								   srcFileName, 
								   rsa, 
								   rsb, 
								   flags)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createPutcInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const UnsignedImmediate> parOffset,
				     shared_ptr<const UnsignedImmediate> posOffset,
				     shared_ptr<const LlirOperand> pipeDepth,
				     shared_ptr<const LlirOperand> flags)
  {
    return (shared_ptr<OctaveInstruction> (new InvalidOctaveInstruction(lineNum, 
									srcLineNum,
									srcFileName)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createGetcInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const UnsignedImmediate> parOffset,
				     shared_ptr<const UnsignedImmediate> posOffset,
				     shared_ptr<const LlirOperand> flags)
  {
    return (shared_ptr<OctaveInstruction> (new InvalidOctaveInstruction(lineNum, 
									srcLineNum,
									srcFileName)));
  }

  shared_ptr<OctaveInstruction>
  M480Factory::createPolcInstruction(unsigned int lineNum,
				     unsigned int srcLineNum,
				     const char* srcFileName, 
				     shared_ptr<const UnsignedImmediate> parOffset,
				     shared_ptr<const UnsignedImmediate> posOffset,
				     shared_ptr<const LlirOperand> flags)
  {
    return (shared_ptr<OctaveInstruction> (new InvalidOctaveInstruction(lineNum, 
									srcLineNum,
									srcFileName)));
  }

}
